In [3]:
import pandas as pd
import numpy as np

sales_df = pd.DataFrame({
    "OrderID": [1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011,1012],
    "Customer": ["Arman","Riya","Kunal","Sneha","Vikram","Pooja","Rahul","Neha","Arjun","Simran","Aman","Zoya"],
    "City": ["Delhi","Mumbai","Delhi","Pune","Mumbai","Delhi","Pune","Delhi","Mumbai","Pune","Delhi","Mumbai"],
    "Category": ["Electronics","Clothing","Electronics","Furniture","Clothing","Electronics","Furniture","Clothing","Electronics","Furniture","Clothing","Electronics"],
    "Amount": [25000,3000,18000,22000,4500,27000,15000,3500,20000,24000,3200,26000],
    "Quantity": [1,2,1,1,3,1,2,2,1,1,2,1],
    "PaymentMode": ["UPI","Card","UPI","Cash","Card","UPI","Cash","UPI","Card","Cash","Card","UPI"]
})

sales_df

    OrderID Customer    City     Category  Amount  Quantity PaymentMode
0      1001    Arman   Delhi  Electronics   25000         1         UPI
1      1002     Riya  Mumbai     Clothing    3000         2        Card
2      1003    Kunal   Delhi  Electronics   18000         1         UPI
3      1004    Sneha    Pune    Furniture   22000         1        Cash
4      1005   Vikram  Mumbai     Clothing    4500         3        Card
5      1006    Pooja   Delhi  Electronics   27000         1         UPI
6      1007    Rahul    Pune    Furniture   15000         2        Cash
7      1008     Neha   Delhi     Clothing    3500         2         UPI
8      1009    Arjun  Mumbai  Electronics   20000         1        Card
9      1010   Simran    Pune    Furniture   24000         1        Cash
10     1011     Aman   Delhi     Clothing    3200         2        Card
11     1012     Zoya  Mumbai  Electronics   26000         1         UPI

In [4]:
# Q1. Total Sales Amount per Category
pd.pivot_table(sales_df,values="Amount",index="Category",aggfunc="mean")

                   Amount
Category
Clothing      3550.000000
Electronics  23200.000000
Furniture    20333.333333

In [5]:
# Q2. Average Order Amount per City
pd.pivot_table(sales_df,values="Amount",index="City",aggfunc="mean")

              Amount
City
Delhi   15340.000000
Mumbai  13375.000000
Pune    20333.333333

In [6]:
# Q3. Total Quantity Sold per Payment Mode
pd.pivot_table(sales_df,values="Quantity",index="PaymentMode",aggfunc="sum")

             Quantity
PaymentMode
Card                8
Cash                4
UPI                 6

In [7]:
# Q4 Total Number of Orders per City
pd.pivot_table(sales_df,values="Quantity",index="City",aggfunc="count")

        Quantity
City
Delhi          5
Mumbai         4
Pune           3

In [8]:
# Q5.Average Amount per Category per City
pd.pivot_table(sales_df,values="Amount",index="Category",columns="City",aggfunc="mean")

City                Delhi   Mumbai          Pune
Category
Clothing      3350.000000   3750.0           NaN
Electronics  23333.333333  23000.0           NaN
Furniture             NaN      NaN  20333.333333

In [9]:
# Total Sales Amount
# Category vs Payment Mode
pd.pivot_table(sales_df,values="Amount",index="Category",columns="PaymentMode",aggfunc="sum")

PaymentMode     Card     Cash      UPI
Category
Clothing     10700.0      NaN   3500.0
Electronics  20000.0      NaN  96000.0
Furniture        NaN  61000.0      NaN

In [10]:
# Average Quantity Sold
# City vs Category
pd.pivot_table(sales_df,values="Quantity",index="Category",columns="City",aggfunc="mean")

City         Delhi  Mumbai      Pune
Category
Clothing       2.0     2.5       NaN
Electronics    1.0     1.0       NaN
Furniture      NaN     NaN  1.333333

In [11]:
# Find Category with Highest Total Sales
pd.pivot_table(sales_df,values="Amount", index="Category",aggfunc="max").sort_values(by="Amount",ascending=False).head()

             Amount
Category
Electronics   27000
Furniture     24000
Clothing       4500

In [12]:
# Alternative
pd.pivot_table(sales_df, values="Amount", index="Category", aggfunc="max")["Amount"].idxmax()

'Electronics'

In [13]:
# Find City Generating Highest Revenue
pd.pivot_table(sales_df,values="Amount",index="City",aggfunc="max")["Amount"].idxmax()

'Delhi'

In [14]:
pd.pivot_table(sales_df,values="Amount",index="City",aggfunc="max").sort_values(by="Amount",ascending=False).head(1)

       Amount
City
Delhi   27000

In [15]:
# Find Payment Mode Used Most Frequently  (using pivot)
pd.pivot_table(sales_df,values="OrderID",index="PaymentMode",aggfunc="count").sort_values(by="OrderID",ascending=False).head()

             OrderID
PaymentMode
UPI                5
Card               4
Cash               3

In [16]:
# Alternate solution using value_count()
sales_df["PaymentMode"].value_counts().idxmax()

'UPI'

In [17]:
# method 3 using groupby
sales_df.groupby("PaymentMode")["OrderID"].count().sort_values(ascending=False).idxmax()

'UPI'

In [18]:
# # REAL BUSINESS THINKING
# Find:

# City wise:
# Total Revenue
# Average Order Value
# (One pivot OR two combine)

pd.pivot_table(sales_df,index="City",values="Amount",aggfunc=["sum","mean"])

          sum          mean
       Amount        Amount
City
Delhi   76700  15340.000000
Mumbai  53500  13375.000000
Pune    61000  20333.333333

In [21]:
# Find:
# (Highest sales per city)
# Real Interview Question

pd.pivot_table(sales_df,index="City",values="Amount",aggfunc="sum").sort_values(by="Amount",ascending=False).head(1)

       Amount
City
Delhi   76700

In [20]:
sales_df

    OrderID Customer    City     Category  Amount  Quantity PaymentMode
0      1001    Arman   Delhi  Electronics   25000         1         UPI
1      1002     Riya  Mumbai     Clothing    3000         2        Card
2      1003    Kunal   Delhi  Electronics   18000         1         UPI
3      1004    Sneha    Pune    Furniture   22000         1        Cash
4      1005   Vikram  Mumbai     Clothing    4500         3        Card
5      1006    Pooja   Delhi  Electronics   27000         1         UPI
6      1007    Rahul    Pune    Furniture   15000         2        Cash
7      1008     Neha   Delhi     Clothing    3500         2         UPI
8      1009    Arjun  Mumbai  Electronics   20000         1        Card
9      1010   Simran    Pune    Furniture   24000         1        Cash
10     1011     Aman   Delhi     Clothing    3200         2        Card
11     1012     Zoya  Mumbai  Electronics   26000         1         UPI

In [22]:
# Top Category in Each City
pd.pivot_table(sales_df,index="City",values="Category",aggfunc="max")

           Category
City
Delhi   Electronics
Mumbai  Electronics
Pune      Furniture

In [24]:
# Create Order Size Column

#  Amount > 20000  Large
#  5000  20000  Medium
#  < 5000  Small
sales_df["order_size"] = sales_df["Amount"].apply(lambda x: "Large" if x >20000 else "Small" if x<5000 else "Medium")
sales_df

,OrderID,Customer,City,Category,Amount,Quantity,PaymentMode,order_size
0,1001,Arman,Delhi,Electronics,25000,1,UPI,Large
1,1002,Riya,Mumbai,Clothing,3000,2,Card,Small
2,1003,Kunal,Delhi,Electronics,18000,1,UPI,Medium
3,1004,Sneha,Pune,Furniture,22000,1,Cash,Large
4,1005,Vikram,Mumbai,Clothing,4500,3,Card,Small
5,1006,Pooja,Delhi,Electronics,27000,1,UPI,Large
6,1007,Rahul,Pune,Furniture,15000,2,Cash,Medium
7,1008,Neha,Delhi,Clothing,3500,2,UPI,Small
8,1009,Arjun,Mumbai,Electronics,20000,1,Card,Medium
9,1010,Simran,Pune,Furniture,24000,1,Cash,Large
10,1011,Aman,Delhi,Clothing,3200,2,Card,Small
11,1012,Zoya,Mumbai,Electronics,26000,1,UPI,Large

In [35]:
# Then Pivot:
# Count of Orders per Order Size per City
pd.pivot_table(sales_df,index="City",values="OrderID",columns="order_size",aggfunc="count",fill_value=0)

order_size  Large  Medium  Small
City
Delhi           2       1      2
Mumbai          1       1      2
Pune            2       1      0